LEXICON_RU:dict = {'/start': 'Это бот RUDN! \n\n\
Здесь вы можете получить доступ к необходимой вам инофрмации всего в пару кликов!\n\n\
Чтобы посмотерть список доступных команд введите /help'
                   ,
     'other_answer': 'Извини, увы, это сообщение мне непонятно...',
                   
                   }

LEXICON_COMMANDS:dict = {
    '/start': 'запустить бота заново',
    '/help':'просмтореть список команд и описание',
    '/search':'поиск разделов по ключевым словам',
    '/setting':'настройка аккаунта в боте',

}
